#+title: Ps 03
#+author: Erik An
#+email: obluda2173@gmail.com
#+date: <2026-01-26>
#+lastmod: <2026-01-29 18:34>
#+latex: \newpage
#+latex_header: \setlength{\parindent}{0pt}
#+latex_header: \setlength{\parskip}{1em}
#+latex_header: \usepackage{amsmath}
#+latex_header: \usepackage{amssymb}
#+latex_header: \usepackage{amsthm}
#+latex_header: \usepackage[margin=1in]{geometry}
#+options: num:t
#+startup: overview latexpreview inlineimages

* Problem 1 :DONE:
** Task
#+begin_quote
The ReLU function is a standard activation function in neural networks. It is simply given by $f:\mathbb{R}\rightarrow\mathbb{R}$
$f(x)=\begin{cases}0,&x\le0,\\ x,&x>0.\end{cases}$
Use the ($\epsilon, \delta$)-definition of continuity to determine, where $f$ is continuous and where not. Plot $f$ in Julia.
#+end_quote

** Notes

- What does it mean "where not"?

  The function $f$ looks to be continuous $\forall x \in \mathbb{R}$. as the $\lim_{x\rightarrow0^+} f(x) = 0$.

  The only suspicion that I have is that it might now be continuous due to $f(x) = x : x > 0$ and not $x \ge 0$, that makes it discontinuous.

** Solution

$$\forall \epsilon > 0 \, \exists \delta > 0 : \forall x, |x - c| < \delta \implies |f(x) - f(c)| < \epsilon$$

The function $f$ is known to be continuous for $\mathbb{R} \textbackslash 0$, as $\forall x \in \mathbb{R} : x < 0, f(x) = 0$, and $\forall x \in \mathbb{R} : x > 0, f(x) = x$ are known to be continuous. Hence, I will validate $f$ 's continuity on point $0$.

Let $\epsilon > 0$. Choose $\delta = |\epsilon|$ such that $|x - 0| < \delta$.

- If $x \le 0$, then $|f(x) - f(0)| = |0 - 0| = 0 < \epsilon$.

- If $x > 0$, then $|f(x) - f(0)| = x < \delta = \epsilon$.

- Code
  #+begin_src julia :results value :exports both :tangle julia/p_1.jl
  #+end_src

* Problem 2 :DONE:
** Task
#+begin_quote
Define another activation function $g:\mathbb{R}\rightarrow\mathbb{R}$,

$$g(x)=\log(1+e^{x})$$

(a) Why is $g$ continuous on $\mathbb{R}$?
(b) Plot $f$ and $g$ in Julia. Which activation function looks "smoother", $f$ or $g$?
#+end_quote

** Solution
- Part (a)

  $$g(x)=\log(1+e^{x})$$

  Since $h(x) = 1 + e^x$ is known to be continuous $\forall x \in \mathbb{R}$, and $r(x) = \log(x)$ is known to be continuous $\forall x \in (0, \infty)$, the function $g(x) = r \circ h = \log(1 + e^x)$ is a composite of two continuous functions and hence is also continuous $\forall x \in \mathbb{R}$ (as $1 + e^x \ge 1 > 0$).

- Part (b)

  #+begin_src julia :results value :exports both :tangle julia/p_2.jl
  using Plots

  f(x) = (x <= 0) ? 0 : x
  g(x) = log(1 + exp(x))

  x = -5.0:0.01:5.0
  f_x = f.(x)
  g_x = g.(x)

  plot(x, f_x,
       title="Activation Functions",
       label="f(x)",
       xlabel="x", ylabel="y",
       lw=2)

  plot!(x, g_x,
        label="g(x)",
        lw=2)

  savefig("./figs/p_02.png")
  #+end_src

  #+RESULTS:
  : /Users/ziro2173/personal/university/01_bachelor/2025_winter_term/01_analysis/02_exercises/set_03/figs/p_02.png

  The activation function $g(x) = \log(1 + e^x)$ is looking smoother.

* Problem 3
** Task
#+begin_quote
A data set contains the locations $X=(1,2,3,4,5,6,7,8,9)^{\top}$ with corresponding observations $Y=(3,5,7,7,11,15,19,?,27)^{\top}$ The observation at $x=8$ is missing.
(a) Provide an educated guess for the observation at $x=8$.
(b) Write new or modify existing Julia code to fill in missing observations.
#+end_quote

** Notes

** Solution
#+begin_src julia :results value :exports both :tangle julia/p_3.jl
#+end_src

* Problem 4 :DONE:
** Task
#+begin_quote
We want to estimate the value of $\exp(1.3)$ by the following procedure:
1. Use Julia to implement a finite sum to determine $e=\exp(1)$ up to an error smaller than $10^{-6}$ according to Proposition 1.3.12.
2. Express $\exp(1.3)$ by using $\exp(1)$ and $\exp(0.3)$.
3. Replace the "unknown" value of $\exp(0.3)$ by a linear approximation from $\exp(0)$ to $\exp(1)$.
4. How big is the error?
#+end_quote

** Solution

- Part (1)

  $$f(x) = e^{x}$$

  |-------+------------+------------------+-------------------------------------|
  | Term  | Derivative | Value at $x_0=0$ | Coefficient $\frac{f^{(k)}(0)}{k!}$ |
  |-------+------------+------------------+-------------------------------------|
  | $k=0$ | $e^{x}$    | $1$              | $\frac{1}{1}$                       |
  |-------+------------+------------------+-------------------------------------|
  | $k=1$ | $e^{x}$    | $1$              | $\frac{1}{1}$                       |
  |-------+------------+------------------+-------------------------------------|
  | $k=2$ | $e^{x}$    | $1$              | $\frac{1}{2!}$                      |
  |-------+------------+------------------+-------------------------------------|
  | $k=3$ | $e^{x}$    | $1$              | $\frac{1}{3!}$                      |
  |-------+------------+------------------+-------------------------------------|
  | ...   | ...        | ...              | ...                                 |
  |-------+------------+------------------+-------------------------------------|

  \begin{align*}
        e^{x} &= \sum_{k=0}^{\infty} \frac{x^{k}}{k!} \\
        e^{1} &= \frac{1}{1} + \frac{1}{1} + \frac{1}{2!} + \frac{1}{3!} + \frac{1}{4!} + ... \\
              &= \sum_{k=0}^{\infty} \frac{1}{k!} \\
  \end{align*}
  \begin{align*}
        f(x) &= e^{x} \\

  \end{align*}

  #+begin_src julia :results value :exports both :tangle julia/p_4.jl
  function approx_e(tol=1e-6)
      k = 1
      sum = 0.0
      term = 1.0

      while term >= tol
          sum += term
          term *= 1/k
          k += 1
      end

      return sum
  end

  approx_e()
  #+end_src

  #+RESULTS:
  : 2.7182815255731922

- Part (2)

  Observe that:

  $$e^{1.3} = e^{1} \cdot e^{0.3} \qquad \text{(basic exponent property)}$$

- Part (3)

  Knowing the values of both $e^{0}$ and $e^{1}$ ($1$, and $2.718\ldots$ respectfully), the value $e^{0.3}$ can be approxiamted by using /Linear Interpolation method/.

  $$y_2 = y_1 + (x_2 - x_1)\frac{y_3 - y_1}{x_3 - x_1}$$

  #+begin_src julia :results value :exports both :tangle julia/p_4.jl
  function approx_e(tol=1e-6)
      k = 1
      sum = 0.0
      term = 1.0

      while term >= tol
          sum += term
          term *= 1/k
          k += 1
      end

      return sum
  end

  function approx_e_power(p) # within e^0 and e^1
      x_1, y_1 = 0.0, 1.0
      x_2 = p
      x_3, y_3 = 1.0, approx_e()

      return y_1 + (x_2 - x_1)*(y_3 - y_1)/(x_3 - x_1)
  end

  approx_e_power(0.3)
  #+end_src

  #+RESULTS:
  : 1.5154844576719575

- Part (4)

  #+begin_src julia :results output :exports both :tangle julia/p_4.jl
  function approx_e(tol=1e-6)
      k = 1
      result = 0.0
      term = 1.0

      while term >= tol
          result += term
          term *= 1/k
          k += 1
      end
      return result
  end

  function approx_e_power(p)
      x_start, y_start = 0.0, 1.0        # exp(0)
      x_end,   y_end   = 1.0, approx_e() # exp(1)

      slope = (y_end - y_start) / (x_end - x_start)

      return y_start + (p - x_start) * slope
  end

  val_e1 = approx_e()             # exp(1)
  val_e03 = approx_e_power(0.3)   # exp(0.3) approx

  est_1_3 = val_e1 * val_e03

  true_val = exp(1.3)
  error = abs(true_val - est_1_3)

  println("Estimated exp(1.3): $est_1_3")
  println("True exp(1.3):      $true_val")
  println("Absolute Error:     $error")
  #+end_src

  #+RESULTS:
  #+begin_example
  approx_e (generic function with 2 methods)
  approx_e_power (generic function with 1 method)
  2.7182815255731922
  1.5154844576719575
  4.119513403582991
  3.6692966676192444
  0.4502167359637461
  Estimated exp(1.3): 4.119513403582991
  True exp(1.3):      3.6692966676192444
  Absolute Error:     0.4502167359637461
  #+end_example

* Problem 5
** Task
#+begin_quote
Consider the two functions $f,g:(0,\infty)\rightarrow\mathbb{R}$ given by

$$f(x)=\log(x), \quad g(x)=2x^{2}-2$$

Plot both functions in Julia and provide mathematical reasons for the number of intersection points that you may observe.
#+end_quote

** Notes

** Solution
#+begin_src julia :results value :exports both :tangle julia/p_5.jl
#+end_src

* Problem 6 :DONE:
** Task
#+begin_quote
Write Julia functions approxSin and approxCos that approximate $\sin$ and $\cos$ by using their truncated series expansions. Plot both functions using your approximations.
#+end_quote

** Notes

\begin{align*}
T(x) = \sum_{k = 0}^{n} \frac{f^{(k)}(x_{0})}{k!} \cdot (x - x_{0})^{k} \\
\end{align*}

$x_{0} = 0$

\begin{align*}
T_{cos}(x) &= \frac{\cos(0)}{1} \cdot x^{0} + \frac{-\sin(0)}{1} \cdot x^{1} + \frac{-\cos(0)}{2} \cdot x^{2} + \frac{\sin(0)}{6} \cdot x^{3} + ... \\
&= 1 - \frac{1}{2}x^{2} + \frac{1}{4!}x^{4} - \frac{1}{6!}x^{6} + ... \\
&= \sum_{k = 0}^{n} \frac{(-1)^{k}}{(2k)!}x^{2k} \\
\cos(x) &= \sum_{k = 0}^{\infty} \frac{(-1)^{k} x^{2k}}{(2k)!} \\
\sin(x) &= \sum_{k = 0}^{\infty} \frac{(-1)^{k} x^{2k+1}}{(2k+1)!} \\
\end{align*}

** Solution
#+begin_src julia :results value :exports both :tangle julia/p_6.jl
using Plots

taylor_cos(x) = sum(((-1)^k * x^(2k))/(factorial(2k)) for k in 0:10)
taylor_sin(x) = sum(((-1)^k * x^(2k+1))/(factorial(2k+1)) for k in 0:9)

x = -pi:0.1:pi

plot(x, taylor_cos.(x), label="Taylor Cos", lw=2)

# 3. Compare it to the REAL cosine (optional but recommended)
plot!(x, taylor_sin.(x), label="Taylor Sin", lw=2)
savefig("./figs/p_06.png")
#+end_src

#+RESULTS:
: /Users/ziro2173/personal/university/01_bachelor/2025_winter_term/01_analysis/02_exercises/set_03/figs/p_06.png
